# Slice Strings Variably

In [1]:
# blab init
try:
    import blab
except ImportError as e:
    !pip install blab
    import blab    
startup_notebook = blab.blab_startup()
%run $startup_notebook

In [3]:
import pandas     as pd 
import bpyth      as bpy

# pandasklar
try:
    import pandasklar as pak 
except ImportError as e:
    !pip install pandasklar
    import pandasklar as pak   
    
# verbose
#pak.Config.set('VERBOSE', True)

VERBOSE = True
--> setting verbose=True as default for all pandasklar functions

time: 10.8 s

## slice_string()
* `slice_string`: Slices a column of strings based on indexes in another columns.

In [3]:
? pak.slice_string

time: 444 ms

Signature:  pak.slice_string(df, col_text, col_start, col_end, col_result)
Docstring:
Slice String based on indexes from columns.
* col_text:   Name of the column containing the  text.
* col_start:  Name of the column containing the  start index OR the start index numeric.
* col_end:    Name of the column containing the  end index   OR the end index numeric.
* col_result: Name of the column to hold the result.
File:      d:\dropbox\31_projekte\01_python\git\pandasklar\src\pandasklar\string.py
Type:      function

In [4]:
# Create test data
anz = 100000
a = pak.random_series( anz, 'name',                                   p_nan=0,   p_dup=0, name='first_name')
b = pak.random_series( anz, 'int',    min=0,  max=2,                  p_nan=0,   p_dup=0, name='from')
c = pak.random_series( anz, 'int',    min=0,  max=5,                  p_nan=0,   p_dup=0, name='plus')
d = pak.random_series( anz, 'int',    min=-3, max=-1,                 p_nan=0,   p_dup=0, name='to2')
df = pak.dataframe( (a, b, c, d) )
df['to'] = df['from'] + df['plus']
mask = (df['to'] > df.first_name.str.len())   |   (df['to'] == 0)
df.loc[mask,'to'] = df[mask].to2
df = pak.drop_cols(df,['plus','to2'])
df

      first_name  from  to
0         Nicole     2   5
1          Julia     0   2
2            Tom     1   1
3          Beate     0   4
4        Martina     1   2
...          ...   ...  ..
99995     Vivien     0   4
99996      Kevin     2  -1
99997   Jennifer     2   5
99998       Anja     1  -2
99999      Tanja     2   5

[100000 rows x 3 columns]

time: 1.83 s

In [5]:
pak.slice_string(df, 'first_name', 'from', 'to', 'first_name_cut')

      first_name  from  to first_name_cut
0         Nicole     2   5            col
1          Julia     0   2             Ju
2            Tom     1   1
3          Beate     0   4           Beat
4        Martina     1   2              a
...          ...   ...  ..            ...
99995     Vivien     0   4           Vivi
99996      Kevin     2  -1             vi
99997   Jennifer     2   5            nni
99998       Anja     1  -2              n
99999      Tanja     2   5            nja

[100000 rows x 4 columns]

time: 584 ms

In [6]:
pak.slice_string(df, 'first_name', 1, -1, 'first_name_cut')

      first_name  from  to first_name_cut
0         Nicole     2   5           icol
1          Julia     0   2            uli
2            Tom     1   1              o
3          Beate     0   4            eat
4        Martina     1   2          artin
...          ...   ...  ..            ...
99995     Vivien     0   4           ivie
99996      Kevin     2  -1            evi
99997   Jennifer     2   5         ennife
99998       Anja     1  -2             nj
99999      Tanja     2   5            anj

[100000 rows x 4 columns]

time: 612 ms